-----------------------------------------------------------------------------------------------------------------------------
      name:  <unnamed>
       log:  /Users/kitagawa/Desktop/『計量経済学』のためのR/untitled folder/06_第6章/chap6_main.log
  log type:  text
 opened on:  20 Apr 2020, 15:42:53

. 
. ** prefecture id
. encode pref, gen(pref1)

. 
. keep if hhtype == "all"
(470 observations deleted)

. 
. keep if year > 1999
(94 observations deleted)

. 
. xtset pref1 year
       panel variable:  pref1 (strongly balanced)
        time variable:  year, 2000 to 2010, but with gaps
                delta:  1 unit

. 
. ** 表 6.3 LaTex形式で出力
. 
. sutex2 emprate caprate age agehus empratehus urate, minmax
%------- Begin LaTeX code -------%
\begin{table}[htbp]\centering \caption{Summary statistics\label{sumstat}}
\begin{tabular}{l c c c c c }\hline\hline
\multicolumn{1}{c}{Variable} & Obs & Mean & Std. Dev.
 & Min & Max  \\ \hline
emprate & 141 & .431 & .097 & .229 & .64  \\
caprate & 141 & .363 & .115 & .138 & .655  \\
age & 141 & 32.73 & .67 & 31.49 & 34.764  \\
agehus & 141 & 34.834 & .531 & 33.877 & 36.859  \\
empratehus & 141 & .965 & .018 & .878 & .989  \\
urate & 141 & .057 & .015 & .03 & .119  \\
\hline
\end{tabular}
\end{table}
%------- End LaTeX code -------%

. 
. ** (6.1)
. 
. reg emprate caprate, robust

Linear regression                               Number of obs     =        141
                                                F(1, 139)         =     196.46
                                                Prob > F          =     0.0000
                                                R-squared         =     0.5336
                                                Root MSE          =     .06662

------------------------------------------------------------------------------
             |               Robust
     emprate |      Coef.   Std. Err.      t    P>|t|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
     caprate |   .6154919   .0439121    14.02   0.000     .5286699    .7023139
       _cons |   .2081492   .0181439    11.47   0.000     .1722755     .244023
------------------------------------------------------------------------------

. 
. 
. ** 実証例 6.1 6.2
. 
. eststo: reg emprate caprate i.pref1, vce(cluster pref1)

Linear regression                               Number of obs     =        141
                                                F(0, 46)          =          .
                                                Prob > F          =          .
                                                R-squared         =     0.9836
                                                Root MSE          =     .01525

                                 (Std. Err. adjusted for 47 clusters in pref1)
------------------------------------------------------------------------------
             |               Robust
     emprate |      Coef.   Std. Err.      t    P>|t|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
     caprate |   .8051027   .0553063    14.56   0.000     .6937769    .9164285
             |
       pref1 |
     京都府  |  -.0157907   .0014583   -10.83   0.000    -.0187261   -.0128553
     佐賀県  |   .1017107   .0000787  1291.88   0.000     .1015522    .1018691
     兵庫県  |   .0139376   .0078312     1.78   0.082    -.0018257    .0297009
     北海道  |   .0472086   .0081542     5.79   0.000      .030795    .0636222
     千葉県  |   .0368712   .0094911     3.88   0.000     .0177666    .0559759
   和歌山県  |   -.100145   .0033997   -29.46   0.000    -.1069882   -.0933018
     埼玉県  |   .0649718   .0111915     5.81   0.000     .0424446     .087499
     大分県  |   .0786482   .0038276    20.55   0.000     .0709437    .0863527
     大阪府  |  -.0118248   .0071566    -1.65   0.105    -.0262302    .0025806
     奈良県  |  -.0521911   .0043338   -12.04   0.000    -.0609146   -.0434676
     宮城県  |   .1460906   .0102467    14.26   0.000      .125465    .1667161
     宮崎県  |   .0735578   .0023669    31.08   0.000     .0687935    .0783221
     富山県  |   .0474861   .0078089     6.08   0.000     .0317677    .0632046
     山口県  |   .0277748   .0024283    11.44   0.000      .022887    .0326626
     山形県  |   .2719284   .0037413    72.68   0.000     .2643975    .2794593
     山梨県  |  -.0212312   .0032472    -6.54   0.000    -.0277674    -.014695
     岐阜県  |   -.010662   .0001272   -83.83   0.000     -.010918    -.010406
     岡山県  |   .0438233   .0019663    22.29   0.000     .0398654    .0477812
     岩手県  |   .1405341   .0015265    92.06   0.000     .1374614    .1436067
     島根県  |   .1024291   .0054795    18.69   0.000     .0913993    .1134588
     広島県  |   .0114802   .0017725     6.48   0.000     .0079123     .015048
     徳島県  |   .0514452   .0010781    47.72   0.000     .0492752    .0536152
     愛媛県  |   .0066101   .0017529     3.77   0.000     .0030816    .0101386
     愛知県  |  -.0179738   .0027556    -6.52   0.000    -.0235205   -.0124272
     新潟県  |   .0524787   .0063201     8.30   0.000     .0397571    .0652004
     東京都  |   .0125847   .0060006     2.10   0.041     .0005061    .0246633
     栃木県  |   .1180016   .0074585    15.82   0.000     .1029884    .1330147
     沖縄県  |   .1535242   .0063537    24.16   0.000     .1407349    .1663135
     滋賀県  |    .039056   .0054812     7.13   0.000     .0280229    .0500891
     熊本県  |   .0569382   .0030337    18.77   0.000     .0508317    .0630448
     石川県  |  -.0158949   .0113839    -1.40   0.169    -.0388095    .0070197
   神奈川県  |   .0455206   .0121357     3.75   0.000     .0210926    .0699486
     福井県  |   .0478417   .0085401     5.60   0.000     .0306513    .0650321
     福岡県  |   .0234296   .0031476     7.44   0.000     .0170938    .0297655
     福島県  |   .2133901    .009003    23.70   0.000      .195268    .2315122
     秋田県  |   .1310402   .0016638    78.76   0.000     .1276912    .1343892
     群馬県  |   .0412263   .0021251    19.40   0.000     .0369486     .045504
     茨城県  |   .0929807   .0079362    11.72   0.000      .077006    .1089555
     長崎県  |   .0690056   .0000387  1781.07   0.000     .0689276    .0690835
     長野県  |   -.073244   .0060147   -12.18   0.000     -.085351    -.061137
     青森県  |    .041126   .0046138     8.91   0.000     .0318389     .050413
     静岡県  |   .1082465   .0086014    12.58   0.000     .0909328    .1255602
     香川県  |   .0508828   .0006408    79.41   0.000      .049593    .0521726
     高知県  |  -.0384989   .0125954    -3.06   0.004     -.063852   -.0131457
     鳥取県  |   .0477726   .0080749     5.92   0.000     .0315186    .0640266
   鹿児島県  |   .0751702    .003601    20.87   0.000     .0679218    .0824187
             |
       _cons |   .0898478   .0214623     4.19   0.000     .0466464    .1330493
------------------------------------------------------------------------------
(est1 stored)

. display e(r2_a)
.97537155

. 
. ** 実証例 6.3
. 
. eststo: reg emprate caprate, vce(cluster pref1)

Linear regression                               Number of obs     =        141
                                                F(1, 46)          =      83.32
                                                Prob > F          =     0.0000
                                                R-squared         =     0.5336
                                                Root MSE          =     .06662

                                 (Std. Err. adjusted for 47 clusters in pref1)
------------------------------------------------------------------------------
             |               Robust
     emprate |      Coef.   Std. Err.      t    P>|t|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
     caprate |   .6154919   .0674294     9.13   0.000     .4797635    .7512203
       _cons |   .2081492   .0282006     7.38   0.000     .1513844     .264914
------------------------------------------------------------------------------
(est2 stored)

. display e(r2_a)
.53020365

. 
. ** 実証例 6.4
. 
. eststo: reg emprate caprate i.year, vce(cluster pref1)

Linear regression                               Number of obs     =        141
                                                F(3, 46)          =     184.01
                                                Prob > F          =     0.0000
                                                R-squared         =     0.5461
                                                Root MSE          =      .0662

                                 (Std. Err. adjusted for 47 clusters in pref1)
------------------------------------------------------------------------------
             |               Robust
     emprate |      Coef.   Std. Err.      t    P>|t|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
     caprate |   .5848218    .073016     8.01   0.000     .4378482    .7317953
             |
        year |
       2005  |   .0138808   .0030731     4.52   0.000      .007695    .0200666
       2010  |   .0279039   .0058786     4.75   0.000     .0160709    .0397368
             |
       _cons |   .2053403   .0280138     7.33   0.000     .1489514    .2617292
------------------------------------------------------------------------------
(est3 stored)

. display e(r2_a)
.53612822

. 
. ** 実証例 6.5
. 
. eststo: reg emprate caprate i.pref1 i.year, vce(cluster pref1)

Linear regression                               Number of obs     =        141
                                                F(2, 46)          =          .
                                                Prob > F          =          .
                                                R-squared         =     0.9946
                                                Root MSE          =     .00885

                                 (Std. Err. adjusted for 47 clusters in pref1)
------------------------------------------------------------------------------
             |               Robust
     emprate |      Coef.   Std. Err.      t    P>|t|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
     caprate |   .0903251    .073568     1.23   0.226    -.0577597    .2384099
             |
       pref1 |
     京都府  |  -.0346376   .0019398   -17.86   0.000    -.0385422   -.0307329
     佐賀県  |   .1027282   .0001047   980.92   0.000     .1025174     .102939
     兵庫県  |  -.0872723    .010417    -8.38   0.000    -.1082406   -.0663041
     北海道  |  -.0581766   .0108467    -5.36   0.000    -.0800099   -.0363433
     千葉県  |   -.085792    .012625    -6.80   0.000    -.1112049   -.0603791
   和歌山県  |  -.0562076   .0045222   -12.43   0.000    -.0653104   -.0471048
     埼玉県  |  -.0796663   .0148868    -5.35   0.000    -.1096319   -.0497008
     大分県  |   .0291805   .0050914     5.73   0.000      .018932     .039429
     大阪府  |  -.1043161   .0095196   -10.96   0.000     -.123478   -.0851541
     奈良県  |  -.1082009   .0057648   -18.77   0.000    -.1198048    -.096597
     宮城県  |   .0136626   .0136301     1.00   0.321    -.0137733    .0410985
     宮崎県  |   .1041473   .0031484    33.08   0.000     .0978099    .1104847
     富山県  |   .1484081   .0103873    14.29   0.000     .1274995    .1693167
     山口県  |  -.0036079     .00323    -1.12   0.270    -.0101097    .0028938
     山形県  |   .2235756   .0049767    44.92   0.000      .213558    .2335931
     山梨県  |   .0207351   .0043194     4.80   0.000     .0120407    .0294295
     岐阜県  |  -.0090183   .0001692   -53.31   0.000    -.0093589   -.0086778
     岡山県  |   .0184115   .0026155     7.04   0.000     .0131468    .0236762
     岩手県  |   .1208059   .0020305    59.50   0.000     .1167187    .1248931
     島根県  |   .1732466   .0072888    23.77   0.000     .1585749    .1879182
     広島県  |  -.0114278   .0023578    -4.85   0.000    -.0161737   -.0066818
     徳島県  |   .0653779    .001434    45.59   0.000     .0624914    .0682645
     愛媛県  |   -.016045   .0023318    -6.88   0.000    -.0207385   -.0113514
     愛知県  |  -.0535867   .0036654   -14.62   0.000    -.0609648   -.0462085
     新潟県  |   .1341593   .0084069    15.96   0.000      .117237    .1510816
     東京都  |  -.0649671    .007982    -8.14   0.000     -.081034   -.0489002
     栃木県  |   .0216082   .0099212     2.18   0.035     .0016378    .0415786
     沖縄県  |   .0714091   .0084516     8.45   0.000     .0543968    .0884213
     滋賀県  |  -.0317827    .007291    -4.36   0.000    -.0464588   -.0171067
     熊本県  |   .0961459   .0040354    23.83   0.000      .088023    .1042687
     石川県  |   .1312305   .0151428     8.67   0.000     .1007496    .1617113
   神奈川県  |  -.1113214   .0161429    -6.90   0.000    -.1438153   -.0788275
     福井県  |   .1582142     .01136    13.93   0.000     .1353477    .1810808
     福岡県  |  -.0172504    .004187    -4.12   0.000    -.0256783   -.0088224
     福島県  |   .0970354   .0119757     8.10   0.000     .0729295    .1211413
     秋田県  |   .1525427   .0022131    68.93   0.000     .1480879    .1569975
     群馬県  |    .013761   .0028268     4.87   0.000     .0080709    .0194511
     茨城県  |  -.0095867   .0105567    -0.91   0.369    -.0308362    .0116628
     長崎県  |   .0685048   .0000515  1329.24   0.000     .0684011    .0686086
     長野県  |   .0044901   .0080007     0.56   0.577    -.0116146    .0205947
     青森県  |   .1007545   .0061372    16.42   0.000     .0884009    .1131082
     静岡県  |  -.0029178   .0114415    -0.26   0.800    -.0259483    .0201128
     香川県  |   .0426017   .0008523    49.98   0.000     .0408861    .0443173
     高知県  |   .1242836   .0167543     7.42   0.000      .090559    .1580082
     鳥取県  |   .1521329   .0107412    14.16   0.000     .1305119    .1737538
   鹿児島県  |   .0286308     .00479     5.98   0.000      .018989    .0382727
             |
        year |
       2005  |   .0343615   .0030038    11.44   0.000     .0283152    .0404078
       2010  |   .0709868   .0064811    10.95   0.000     .0579411    .0840326
             |
       _cons |   .3321107    .025824    12.86   0.000     .2801296    .3840917
------------------------------------------------------------------------------
(est4 stored)

. display e(r2_a)
.99171766

. 
. ** 実証例 6.6
. 
. reg emprate caprate i.year i.pref1##c.year, vce(cluster pref1)
note: year omitted because of collinearity

Linear regression                               Number of obs     =        141
                                                F(1, 46)          =          .
                                                Prob > F          =          .
                                                R-squared         =     0.9994
                                                Root MSE          =     .00411

                                 (Std. Err. adjusted for 47 clusters in pref1)
------------------------------------------------------------------------------
             |               Robust
     emprate |      Coef.   Std. Err.      t    P>|t|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
     caprate |   .0915262   .1711945     0.53   0.595    -.2530704    .4361228
             |
        year |
       2005  |   .0370324   .0055976     6.62   0.000     .0257651    .0482998
       2010  |   .0763236   .0122296     6.24   0.000     .0517067    .1009404
             |
       pref1 |
     京都府  |  -2.871965   .2980214    -9.64   0.000     -3.47185   -2.272079
     佐賀県  |   2.217742   1.038862     2.13   0.038       .12662    4.308863
     兵庫県  |  -1.674138   .3096748    -5.41   0.000    -2.297481   -1.050795
     北海道  |   -2.02719     .37198    -5.45   0.000    -2.775947   -1.278433
     千葉県  |   1.008548   .8235899     1.22   0.227    -.6492523    2.666349
   和歌山県  |  -2.425116   1.995858    -1.22   0.231     -6.44257    1.592339
     埼玉県  |  -3.204948   .2345059   -13.67   0.000    -3.676984   -2.732912
     大分県  |   .0050694   .1070373     0.05   0.962    -.2103855    .2205243
     大阪府  |  -3.544671     .57915    -6.12   0.000    -4.710439   -2.378902
     奈良県  |  -2.726162    .228627   -11.92   0.000    -3.186364   -2.265959
     宮城県  |   6.645165    .295727    22.47   0.000     6.049897    7.240432
     宮崎県  |   .8787099    .071676    12.26   0.000     .7344336    1.022986
     富山県  |   .6196086   2.014007     0.31   0.760    -3.434376    4.673594
     山口県  |   1.556478    .269435     5.78   0.000     1.014133    2.098822
     山形県  |    12.6247   1.220832    10.34   0.000     10.16729    15.08211
     山梨県  |    1.02493   2.030431     0.50   0.616    -3.062114    5.111975
     岐阜県  |   1.822042   .5200575     3.50   0.001       .77522    2.868863
     岡山県  |   1.027391   .7911337     1.30   0.201    -.5650783    2.619861
     岩手県  |   3.840668   2.153963     1.78   0.081    -.4950344     8.17637
     島根県  |  -2.455883   3.853635    -0.64   0.527    -10.21285    5.301081
     広島県  |   1.248301   .3022791     4.13   0.000     .6398444    1.856757
     徳島県  |   1.757557   .5668531     3.10   0.003     .6165412    2.898573
     愛媛県  |  -.4404849   .7973317    -0.55   0.583     -2.04543     1.16446
     愛知県  |   .3278358   .7286387     0.45   0.655    -1.138838    1.794509
     新潟県  |   3.477846   1.423998     2.44   0.018     .6114864    6.344205
     東京都  |   .7338299   1.591782     0.46   0.647    -2.470261     3.93792
     栃木県  |   3.625322   .0880897    41.15   0.000     3.448006    3.802637
     沖縄県  |   .4899876    .646054     0.76   0.452    -.8104517    1.790427
     滋賀県  |   1.900471   .2319346     8.19   0.000     1.433611    2.367332
     熊本県  |   3.927155    .206827    18.99   0.000     3.510834    4.343476
     石川県  |   .3910306    1.23451     0.32   0.753    -2.093909     2.87597
   神奈川県  |  -.6634177   .1870509    -3.55   0.001    -1.039932   -.2869038
     福井県  |   3.534844     1.8237     1.94   0.059     -.136074    7.205763
     福岡県  |   1.497742   .6314775     2.37   0.022     .2266433     2.76884
     福島県  |   11.17376    .508535    21.97   0.000     10.15014    12.19739
     秋田県  |   1.732415   2.860855     0.61   0.548    -4.026188    7.491018
     群馬県  |  -4.778099   1.218682    -3.92   0.000     -7.23118   -2.325019
     茨城県  |   1.526227   .6399067     2.39   0.021     .2381611    2.814292
     長崎県  |  -.6210245    1.30992    -0.47   0.638    -3.257757    2.015708
     長野県  |   2.192686   1.028524     2.13   0.038     .1223755    4.262996
     青森県  |  -1.478748   2.070665    -0.71   0.479     -5.64678    2.689284
     静岡県  |   1.468926   .4231499     3.47   0.001     .6171696    2.320683
     香川県  |  -.2331845    .159135    -1.47   0.150    -.5535068    .0871377
     高知県  |   7.650524   .3197372    23.93   0.000     7.006927    8.294122
     鳥取県  |    1.84547   .6878894     2.68   0.010      .460821     3.23012
   鹿児島県  |  -1.877758   .3170812    -5.92   0.000    -2.516009   -1.239507
             |
        year |          0  (omitted)
             |
pref1#c.year |
     京都府  |   .0014151   .0001509     9.38   0.000     .0011114    .0017189
     佐賀県  |  -.0010549   .0005183    -2.04   0.048    -.0020981   -.0000117
     兵庫県  |   .0007915   .0001665     4.75   0.000     .0004563    .0011268
     北海道  |   .0009821   .0001981     4.96   0.000     .0005834    .0013809
     千葉県  |  -.0005457   .0004254    -1.28   0.206     -.001402    .0003106
   和歌山県  |   .0011815   .0010007     1.18   0.244    -.0008328    .0031957
     埼玉県  |   .0015589   .0001342    11.61   0.000     .0012887    .0018291
     大分県  |   .0000121   .0000593     0.20   0.840    -.0001073    .0001314
     大阪府  |    .001716   .0002778     6.18   0.000     .0011568    .0022752
     奈良県  |   .0013058   .0001073    12.16   0.000     .0010897    .0015218
     宮城県  |  -.0033074   .0001317   -25.12   0.000    -.0035724   -.0030423
     宮崎県  |  -.0003863   .0000394    -9.80   0.000    -.0004657    -.000307
     富山県  |  -.0002351   .0010165    -0.23   0.818    -.0022813    .0018111
     山口県  |  -.0007781   .0001381    -5.63   0.000    -.0010561      -.0005
     山形県  |  -.0061851   .0006031   -10.26   0.000    -.0073991    -.004971
     山梨県  |  -.0005009   .0010177    -0.49   0.625    -.0025494    .0015476
     岐阜県  |  -.0009132   .0002596    -3.52   0.001    -.0014357   -.0003907
     岡山県  |  -.0005032   .0003915    -1.29   0.205    -.0012913    .0002849
     岩手県  |  -.0018553   .0010719    -1.73   0.090     -.004013    .0003024
     島根県  |   .0013112   .0019305     0.68   0.500    -.0025746    .0051971
     広島県  |  -.0006283    .000148    -4.24   0.000    -.0009262   -.0003303
     徳島県  |   -.000844   .0002844    -2.97   0.005    -.0014164   -.0002716
     愛媛県  |   .0002117   .0004004     0.53   0.600    -.0005942    .0010176
     愛知県  |  -.0001902   .0003677    -0.52   0.607    -.0009303    .0005499
     新潟県  |  -.0016677     .00072    -2.32   0.025     -.003117   -.0002185
     東京都  |  -.0003983   .0008032    -0.50   0.622     -.002015    .0012184
     栃木県  |  -.0017973   .0000324   -55.44   0.000    -.0018625    -.001732
     沖縄県  |  -.0002087   .0003124    -0.67   0.507    -.0008376    .0004202
     滋賀県  |  -.0009637   .0001241    -7.76   0.000    -.0012135   -.0007138
     熊本県  |  -.0019108   .0000985   -19.40   0.000     -.002109   -.0017125
     石川県  |  -.0001297   .0006333    -0.20   0.839    -.0014044     .001145
   神奈川県  |   .0002755    .000112     2.46   0.018       .00005     .000501
     福井県  |  -.0016842   .0009228    -1.83   0.074    -.0035416    .0001732
     福岡県  |  -.0007556   .0003198    -2.36   0.022    -.0013993   -.0001118
     福島県  |  -.0055245   .0002397   -23.04   0.000     -.006007   -.0050419
     秋田県  |   -.000788   .0014294    -0.55   0.584    -.0036653    .0020893
     群馬県  |     .00239   .0006045     3.95   0.000     .0011731    .0036069
     茨城県  |  -.0007659   .0003069    -2.50   0.016    -.0013837   -.0001481
     長崎県  |   .0003439   .0006533     0.53   0.601    -.0009711    .0016589
     長野県  |  -.0010914   .0005223    -2.09   0.042    -.0021427   -.0000402
     青森県  |   .0007877   .0010399     0.76   0.453    -.0013054    .0028809
     静岡県  |   -.000734   .0002243    -3.27   0.002    -.0011855   -.0002824
     香川県  |   .0001376   .0000784     1.75   0.086    -.0000202    .0002953
     高知県  |  -.0037539     .00014   -26.81   0.000    -.0040357    -.003472
     鳥取県  |  -.0008446   .0003556    -2.38   0.022    -.0015603    -.000129
   鹿児島県  |   .0009509   .0001637     5.81   0.000     .0006213    .0012804
             |
       _cons |   .3289753   .0605403     5.43   0.000     .2071139    .4508367
------------------------------------------------------------------------------

. display e(r2_a)
.9982088

. 
. ** 表 6.5 (5) (6)
. 
. eststo: reg emprate caprate i.year age agehus empratehus urate, vce(cluster pref1)

Linear regression                               Number of obs     =        141
                                                F(7, 46)          =      63.68
                                                Prob > F          =     0.0000
                                                R-squared         =     0.5887
                                                Root MSE          =     .06396

                                 (Std. Err. adjusted for 47 clusters in pref1)
------------------------------------------------------------------------------
             |               Robust
     emprate |      Coef.   Std. Err.      t    P>|t|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
     caprate |   .5352696   .0682135     7.85   0.000     .3979629    .6725762
             |
        year |
       2005  |   .0349813   .0403981     0.87   0.391    -.0463359    .1162985
       2010  |   .0876871   .0678689     1.29   0.203    -.0489259    .2243001
             |
         age |  -.0036571   .0931177    -0.04   0.969    -.1910933    .1837791
      agehus |  -.0505569   .0812018    -0.62   0.537    -.2140077     .112894
  empratehus |   .0650309    .440352     0.15   0.883    -.8213517    .9514135
       urate |  -.2045183   1.054659    -0.19   0.847    -2.327436      1.9184
       _cons |   2.025953   1.041856     1.94   0.058    -.0711933      4.1231
------------------------------------------------------------------------------
(est5 stored)

. eststo: reg emprate caprate i.year age agehus empratehus urate i.pref1, vce(cluster pref1)

Linear regression                               Number of obs     =        141
                                                F(6, 46)          =          .
                                                Prob > F          =          .
                                                R-squared         =     0.9960
                                                Root MSE          =     .00776

                                 (Std. Err. adjusted for 47 clusters in pref1)
------------------------------------------------------------------------------
             |               Robust
     emprate |      Coef.   Std. Err.      t    P>|t|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
     caprate |   .1140253    .073138     1.56   0.126    -.0331939    .2612444
             |
        year |
       2005  |   .0521498   .0157304     3.32   0.002     .0204861    .0838135
       2010  |    .092221   .0262535     3.51   0.001     .0393755    .1450665
             |
         age |  -.0266137   .0339276    -0.78   0.437    -.0949065     .041679
      agehus |   .0408774   .0334068     1.22   0.227     -.026367    .1081219
  empratehus |   .3110722   .1576536     1.97   0.055     -.006268    .6284124
       urate |  -.6612611   .3033269    -2.18   0.034    -1.271826   -.0506958
             |
       pref1 |
     京都府  |  -.0296759   .0084327    -3.52   0.001    -.0466499   -.0127018
     佐賀県  |   .1108596   .0046971    23.60   0.000     .1014048    .1203145
     兵庫県  |  -.0729143   .0133213    -5.47   0.000    -.0997287   -.0460999
     北海道  |  -.0364974   .0144556    -2.52   0.015     -.065595   -.0073997
     千葉県  |  -.0826696    .014201    -5.82   0.000    -.1112548   -.0540844
   和歌山県  |  -.0417704   .0076291    -5.48   0.000    -.0571271   -.0264138
     埼玉県  |  -.0760259   .0160625    -4.73   0.000     -.108358   -.0436939
     大分県  |   .0449059   .0096251     4.67   0.000     .0255316    .0642803
     大阪府  |  -.0717537   .0171895    -4.17   0.000    -.1063542   -.0371531
     奈良県  |  -.0987117    .010718    -9.21   0.000    -.1202859   -.0771375
     宮城県  |   .0415475   .0168858     2.46   0.018     .0075581    .0755368
     宮崎県  |   .1260528    .010971    11.49   0.000     .1039693    .1481362
     富山県  |   .1435415   .0108678    13.21   0.000     .1216657    .1654174
     山口県  |   .0081592   .0064559     1.26   0.213    -.0048359    .0211542
     山形県  |   .2235259   .0053416    41.85   0.000     .2127738     .234278
     山梨県  |   .0138109   .0085361     1.62   0.113    -.0033713    .0309932
     岐阜県  |  -.0133882   .0024617    -5.44   0.000    -.0183433   -.0084331
     岡山県  |   .0345932   .0067477     5.13   0.000     .0210107    .0481756
     岩手県  |   .1314025   .0050548    26.00   0.000     .1212277    .1415773
     島根県  |   .1677042   .0082502    20.33   0.000     .1510973    .1843111
     広島県  |   -.003029   .0052532    -0.58   0.567    -.0136031    .0075452
     徳島県  |   .0884781   .0084696    10.45   0.000     .0714297    .1055265
     愛媛県  |   .0066478   .0092067     0.72   0.474    -.0118843    .0251798
     愛知県  |  -.0569805   .0041672   -13.67   0.000    -.0653687   -.0485923
     新潟県  |   .1306373   .0095348    13.70   0.000     .1114448    .1498299
     東京都  |   -.068524   .0165955    -4.13   0.000     -.101929   -.0351191
     栃木県  |   .0317092   .0105462     3.01   0.004     .0104809    .0529376
     沖縄県  |   .1301841   .0258949     5.03   0.000     .0780604    .1823078
     滋賀県  |  -.0321546   .0072508    -4.43   0.000    -.0467498   -.0175594
     熊本県  |   .1123744   .0093112    12.07   0.000     .0936319    .1311169
     石川県  |   .1277046   .0153552     8.32   0.000     .0967961     .158613
   神奈川県  |  -.1111037   .0182311    -6.09   0.000     -.147801   -.0744065
     福井県  |   .1476462   .0117198    12.60   0.000     .1240555    .1712369
     福岡県  |   .0086234   .0127625     0.68   0.503    -.0170662    .0343129
     福島県  |   .1172253   .0132418     8.85   0.000     .0905709    .1438797
     秋田県  |   .1608049   .0069483    23.14   0.000     .1468187    .1747911
     群馬県  |   .0212675   .0059825     3.55   0.001     .0092253    .0333097
     茨城県  |   .0017789   .0113695     0.16   0.876    -.0211066    .0246644
     長崎県  |   .0808512   .0092802     8.71   0.000     .0621711    .0995312
     長野県  |  -.0130322   .0112684    -1.16   0.253    -.0357143    .0096499
     青森県  |   .1211526   .0118634    10.21   0.000     .0972728    .1450324
     静岡県  |  -.0067074   .0118852    -0.56   0.575     -.030631    .0172163
     香川県  |   .0590397   .0058829    10.04   0.000      .047198    .0708813
     高知県  |   .1479588    .020738     7.13   0.000     .1062153    .1897022
     鳥取県  |   .1520382   .0109495    13.89   0.000      .129998    .1740783
   鹿児島県  |   .0419778   .0083922     5.00   0.000     .0250853    .0588703
             |
       _cons |  -.5146458   .3911073    -1.32   0.195    -1.301904    .2726123
------------------------------------------------------------------------------
(est6 stored)

. 
. **回帰分析表を，LaTex形式のファイルに出力
.  esttab using tabchap6.tex, replace cells(b(star fmt(3)) se(par fmt(3))) stats(r2_a N, fmt(3 0) label("$\bar R^2$")) label 
>                               ///
>      title(Specification 1)       ///
>      nonumbers mtitles("(1)" "(2)" "(3)" "(4)" "(5)" "(6)")  ///
>     addnote("適切な注釈を入れること")
(note: file tabchap6.tex not found)
(output written to tabchap6.tex)

. 
. eststo clear

. 
. ** ログファイルを閉じる
. log close
      name:  <unnamed>
       log:  /Users/kitagawa/Desktop/『計量経済学』のためのR/untitled folder/06_第6章/chap6_main.log
  log type:  text
 closed on:  20 Apr 2020, 15:42:55
-----------------------------------------------------------------------------------------------------------------------------
